Repository: enguerranws/import-tweets-as-wp-posts
Catalog: i18n/tweets-to-posts-*.po
Languages: fr_fr

source: Tweets query options
fr_fr: Options de recherche de tweet

source: Query type:
fr_fr: Type de recherche :

source: Query (will search in tweets content)
fr_fr: Recherche libre (dans les contenus de tweets)

source: User (find tweets from an user)
fr_fr: Utilisateur (pour trouver des tweets d'un utilisateur)

source: Hashtag (find tweets with a hashtag)
fr_fr: Hashtag (pour trouver des tweets contenant un hashtag spécifique)

source: Query text:
fr_fr: Requête :

source: Don't type # or @, just the query.
fr_fr: Ne tapez pas # ou @, juste la requête

source: Only tweets with image?
fr_fr: Trouver uniquement des tweets contenant une image ?

source: Yes
fr_fr: Oui

source: No
fr_fr: Non

source: Exclude replies?
fr_fr: Exclure les réponses de tweets ?

source: Tweets number per page?
fr_fr: Nombre de tweets par page ?

source: Default: 30
fr_fr: Par défaut : 30

source: List of last Twitter posts for the query:
fr_fr: Liste des dernières tweets pour la requête :

source: Preview/thumbnail
fr_fr: Preview / Miniature

source: Author username
fr_fr: Nom d'utilisateur

source: Tweet text
fr_fr: Contenu du tweet

source: Load more tweets
fr_fr: Charger plus de tweets

source: Your Twitter API access is not defined, go set it on the settings page.
fr_fr: Votre clé API Twitter n'est pas renseignée. Faites le sur la page de réglages.

source: Twitter API settings:
fr_fr: Réglages d'API Twitter :

source: Wordpress feed options:
fr_fr: Options de remplissage de Wordpress

source: Post type to feed:
fr_fr: Type de post à alimenter :

source: Category to feed:
fr_fr: Catégorie à alimenter :

source: Use a custom title?
fr_fr: Utiliser un titre personnalisé ?

source: e.g : Last tweet by %a%, posted on %d%
fr_fr: Par exemple : Dernier tweet par %a%, posté le %d% (%a% : auteur, %d% pour la date)

source: You can use Tweet date (%d%) and Tweet (%a%) author to customize your title
fr_fr: Vous pouvez utiliser la date d'un tweet (%d%) et l'auteur d'un tweet (%a%).

source: How can I get a Twitter API key and access tokens?
fr_fr: Comment récupérer une clé API Twitter et des tokens d'accès ?

source: It's done, congrats :)
fr_fr: C'est fait, bien joué !

source: Login to https://apps.twitter.com/ using your Twitter account
fr_fr: Connectez-vous sur https://apps.twitter.com/ avec votre compte Twitter

source: Click on "Create new app"
fr_fr: Cliquez sur \"Create new app\"

source: Set up your Twitter app
fr_fr: Configurez votre appli Twitter

source: On your new app dashboard, click on Keys and access tokens : there you can find your Consumer Key and your Consumer Secret
fr_fr: Sur le tableau de bord de votre app, les Consumer Key et Consumer Secret sont disponibles

source: On the bottom of this page, click on Create My access token and token secret
fr_fr: En bas de page, cliquez sur \"Create My access token and token secret\"

source: Now that you have your Consumer Key, your Consumer Secret, your Access Token and your Access Token Secret copy them into the Tweets to Posts Settings page
fr_fr: Maintenant, vous avez tous les accès requis pour communiquer avec l'API Twitter (Consumer Key, Consumer Secret, Access Token, Access Token Secret). Gardez-les sous la main et copiez les dans la page de réglages Tweets to Posts.

source: To use this plugin, you'll need to create a Twitter API key. Dealing with Twitter Developers Console can be a bit confusing. Here's how to do that:
fr_fr: Pour utiliser ce plugin, vous allez avoir besoin d'une clé API Twitter. Ça peut être un peu délicat pour les plus novices, mais voici comment faire :

source: Loading...
fr_fr: Chargement...

source: Post added !
fr_fr: Post ajouté !

source: Tweet rejected !
fr_fr: Tweet rejeté !

source: Approve
fr_fr: Ajouter

source: Deny
fr_fr: Rejeter
